{
	"markers": [{
			"lat": 43.82317294949027,
			"lng": -79.3691784879962,
			"title": "Primont Homes (Leslie/John) Inc. - 2300 John St.",
			"description": "Applications to amend the the Official Plan and Zoning-By-law have been submitted by Primont Homes (Leslie/John) Inc. to permit the redevelopment of the subject lands at the northeast corner of John Street/Leslie Street into a mixed use high rise development consisting of 593 residential apartment units shared between two residential towers ranging in height between 17 and 28 storeys.",
			"link": "https://markhamward1.ca/2300-john-st/"
		},
		{
			"lat": 43.829577046645504, 
			"lng": -79.42385442944916,
			"title": "Thornheights Homes Inc. - 16 Kirk Dr.",
			"description": "A Zoning By-law Amendment application has been submitted by Thornheights Homes Inc. to permit 8 townhouse unites on the subject property at 16 Kirk Drive.",
			"link": "https://markhamward1.ca/new-development-proposed-thornheights-homes-inc-16-kirk-dr/"
		},
		{
			"lat": 43.82037351807402, 
			"lng": -79.39845085691101,
			"title": "Thornhill Square Shopping Centre - 288, 290, 292, 294, 296, 298 & 300 John St.",
			"description": "Applications to amend the the Official Plan and Zoning-By-law have been submitted by Timbercreek Quadrant Four GP Inc. to permit the redevelopment of the existing Thornhill Square Shopping Centre at 288, 290, 292, 294, 296, 298 and 300 John Street. The application proposes for the development of 615 residential (non-rental and market-based rental) units shared between 4 buildings (4 towers) ranging between 7 and 19 storeys.",
			"link": "https://markhamward1.ca/288-290-292-294-296-298-300-john-st-thornhill-square-shopping-centre/"
		},
		{
			"lat": 43.82080062150023, 
			"lng": -79.40408314537558,
			"title": "Shouldice Hospital Lands - 7750 Bayview Ave.",
			"description": "Applications to amend the the Official Plan and Zoning-By-law have been submitted by 7750 Bayview Avenue Limited Partnership to permit the redevelopment of the Shouldice Hospital lands at 7750 Bayview Avenue. With the hospital continuing to operate under a leased arrangement for 16 more years, the development proposal outlines a long-term approach with four directional (north, south, east and west) phases. The North Block (Phase I) application before us now proposes for the development of 1,287 residential units shared between 3 buildings (5 towers) ranging between 18 and 35 storeys.",
			"link": "https://markhamward1.ca/7750-bayview-avenue-shouldice-hospital-lands/"
		},
		{
			"lat": 43.798960524776795, 
			"lng": -79.4169494576985,
			"title": "Zonix - 36 Steeles Avenue East",
			"description": "Applications to amend the the Official Plan and Zoning-By-law have been submitted by Zonix for 36-60 Steeles Avenue East; 37-63 Highland Park Boulevard to permit a 27 storey building on Steeles Ave. and a 6 storey building on Highland Park Blvd, with a total of 533 residential units. being proposed between the two buildings.",
			"link": "https://markhamward1.ca/zonix-36-steeles-avenue-east/"
		},
		{
			"lat": 43.819879243325744, 
			"lng": -79.39179919887025,
			"title": "349-351 John St.",
			"description": "A Zoning By-law Amendment application have been submitted by 349-351 John Street Inc. to permit motor vehicle sales, a restaurant, and a recreational establishment (bowling alley) on the subject lands. The applicant is proposing to amend the Zoning By-law to add motor vehicle sales with limited accessory outdoor storage and the display of motor vehicles, a restaurant, and a recreational establishment as permitted uses.",
			"link": "https://markhamward1.ca/349-351-john-st/"
		},
		{
			"lat": 43.82332452689959, 
			"lng": -79.4254241019279,
			"title": "Royal Orchard and Yonge",
			"description": "Applications to amend the the Official Plan and Zoning-By-law have been submitted by Greencapital Limited Partnership to permit a multi-building, mixed use high rise development at the northeast corner of Royal Orchard Boulevard and Yonge Street. The application proposes for a total of 1560 residential unites shared by 4 Residential towers on the north side of Royal Orchard Boulevard between Yonge Street and Inverlochy Boulevard ranging in height between 25 and 59 storeys.",
			"link": "https://markhamward1.ca/royal-orchard-and-yonge/"
		},
		{
			"lat": 43.823073652621844, 
			"lng": -79.40519021744682,
			"title": "Royal Orchard and Bayview",
			"description": "Applications to amend the the Official Plan and Zoning-By-law have been submitted by on behalf of the Ladies Golf Club of Toronto by Tridel. The proposal is to build a 12 storey residential building, a 14 storey residential building and a public park on 2.46 acres of land, currently comprising the 9th hole of the golf course, located at the southwest corner of Royal Orchard Boulevard and Bayview Avenue.",
			"link": "https://markhamward1.ca/royal-orchard-and-bayview/"
		},
		{
			"lat": 43.83674402612656, 
			"lng": -79.41257447756868,
			"title": "Langstaff Gateway",
			"description": "Zoning By-law Amendment and Draft Plan of Subdivision applications have been submitted by Langstaff Land Holdings Ltd., for 3.92 hectares (9.69 acres) at 201, 203, 205, and 206 Langstaff Road East and 3, 5, 11, and 17 Essex Avenue. The application proposes the development of 1,668 residential units with ground floor retail space shared between 6 buildings ranging between 7 and 49 storeys.",
			"link": "https://markhamward1.ca/langstaff-gateway/"
		},
		{
			"lat": 43.81181749872431, 
			"lng": -79.41293829440357,
			"title": "York Region District School Board — 160 Henderson Ave.",
			"description": "A FOURTH REVISED Site Plan Control application has been received from York Region District School Board (Bryan Blackert) c/o MC Architects Inc. for 160 Henderson Avenue. The applicant is proposing to replace the two existing schools with a new two-storey elementary school including a gym and library.",
			"link": "https://markhamward1.ca/york-region-district-school-board-160-henderson-avenue/"
		},
		{
			"lat": 43.83270540069706, 
			"lng": -79.38959427274457,
			"title": "Huntington Park Culvert Rehabilitation Options",
			"description": "Councillor Keith Irish met with city staff on August 10th, 2020 to discuss options for the rehabilitation and repair of the culvert in Huntington Park.",
			"link": "https://markhamward1.ca/huntington-park-culvert-rehabilitation-options/"
		},
		{
			"lat": 43.81637186824847, 
			"lng": -79.42462311723317,
			"title": "Yonge North Subway Extension Intensification Analysis",
			"description": "The City of Markham undertook a 'Yonge North Subway Extension Intensification Analysis' for consideration by Metrolinx as they deliberate the locations for potential subway stations from Steeles Avenue to Richmond Hill Centre.",
			"link": "https://markhamward1.ca/yonge-north-subway-extension-intensification-analysis/"
		}
	]
}